Config/Catalogs/НастройкаВариантовДействийАктуализацииНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкаВариантовДействийАктуализацииНачислений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаФормирования</Name>
					<Comment>В данном реквизите хранится схема СКД выбранной настройки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВариантов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПримененияВарианта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантДействий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантДействияАктуализацииНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/НастройкаВариантовДействийАктуализацииНачислений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура СформироватьСхемуФормирования(НастройкаВариантовДействий,Отказ) Экспорт
	
	СообщатьОбОшибках = Истина;
	
	Если НастройкаВариантовДействий.ДополнительныеСвойства.Свойство("НеСообщатьОбОшибках") Тогда
		СообщатьОбОшибках = Ложь;
	КонецЕсли;
	
					   
	Если НастройкаВариантовДействий.ТаблицаВариантов.Количество() = 0 Тогда
		СхемаКомпоновки = Новый ХранилищеЗначения(Неопределено);
		Возврат;
	КонецЕсли;
 
	СхемаКомпоновки = Справочники.НастройкаВариантовДействийАктуализацииНачислений.ПолучитьМакет("СхемаПоУмолчанию");
		
	ВыражениеВыбораВарианта = "ВЫБОР ";

	Для Каждого СтрТЧ Из НастройкаВариантовДействий.ТаблицаВариантов Цикл
			
		НовПараметр = СхемаКомпоновки.Параметры.Добавить();
		НовПараметр.Имя = "Вариант"+СтрТЧ.НомерСтроки;
		НовПараметр.ОграничениеИспользования = Истина;
		НовПараметр.Значение = СтрТЧ.ВариантДействий;
		
		ВыражениеВыбораВарианта = ВыражениеВыбораВарианта + " КОГДА ("+ ?(ЗначениеЗаполнено(СтрТЧ.УсловиеПримененияВарианта),СтрТЧ.УсловиеПримененияВарианта,"ЛОЖЬ")+") = ИСТИНА ТОГДА &Вариант"+СтрТЧ.НомерСтроки+" ";
	
	КонецЦикла;
	ВыражениеВыбораВарианта = ВыражениеВыбораВарианта + " ИНАЧЕ Значение(Справочник.ВариантДействияАктуализацииНачислений.ПустаяСсылка) КОНЕЦ";	
		
	МассивИспользуемыхРеквизитов = Новый Массив;
	РезультатОбработкиВыражения = "";
	ОписаниеОшибки = "";
	Попытка
		БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ВыражениеВыбораВарианта,РезультатОбработкиВыражения,"Условие использования варианта действий",МассивИспользуемыхРеквизитов,"","",ОписаниеОшибки,Ложь);
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,1,"""Условие использования варианта действий""",ИнформацияОбОшибке().Описание);
	
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Настройка вариантов действий актуализации начислений. Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.НастройкаВариантовДействийАктуализацииНачислений, НастройкаВариантовДействий.Ссылка, ТекстОшибки);
						
		ОчиститьСхемуФормирования(НастройкаВариантовДействий);
		//Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	ВычисляемоеПоле = СхемаКомпоновки.ВычисляемыеПоля.Найти("ВариантДействий");
	ВычисляемоеПоле.Выражение = РезультатОбработкиВыражения;
				
	Хранилище = Новый ХранилищеЗначения(СхемаКомпоновки);

	НастройкаВариантовДействий.СхемаФормирования = Хранилище;
	
КонецПроцедуры

Процедура СохранитьНастройкуВФайл(Настройка,Адрес,УИД) Экспорт
	
	МассивНастройки     = Новый Массив;
	МассивНастройки.Добавить(Настройка);	
	
	МассивВариантов = ПолучитьВариантыПоНастройке(Настройка);
	
	НевыгружаемыеПоляНастройки = "Код, ПометкаУдаления, Предопределенный, СхемаФормирования, PredefinedDataName";
	
	НевыгружаемыеПоляВариантов = "Код, ПометкаУдаления, Предопределенный, PredefinedDataName";	
	
	МассивПараметры = Новый Массив;
	
	МассивПараметры.Добавить(Новый Структура(
			"МассивСсылки, НевыгружаемыеПоля", МассивНастройки, НевыгружаемыеПоляНастройки));
			
	МассивПараметры.Добавить(Новый Структура(
			"МассивСсылки, НевыгружаемыеПоля", МассивВариантов, НевыгружаемыеПоляВариантов));
			
	
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
			
	ВыгрузкаЗагрузкаСлужебныхДанных.УниверсальнаяВыгрузкаСправочников(ИмяВремФайла, МассивПараметры, 
		"Файл настройки вариантов актуализации """+Строка(Настройка)+"""", ТекущаяДатаСеанса());  
			
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВремФайла),УИД);
	
КонецПроцедуры

Функция ЗагрузитьНастройкуИзФайла(АдресФайла) Экспорт
	
	Результат = Истина;
	
	Попытка
	
		Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			РабИмяФайла = ИмяВременногоФайла;
			
		Иначе
			
			РабИмяФайла = АдресФайла;
			
		КонецЕсли;
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(РабИмяФайла);
		
		Результат = ВыгрузкаЗагрузкаСлужебныхДанных.УниверсальнаяЗагрузкаСправочников(ЧтениеXML, Истина);
		
		ЧтениеXML.Закрыть();
		
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура ЗагрузитьНастройкуИзМакета() Экспорт
	
	Попытка              
		ТекМакет = Справочники.НастройкаВариантовДействийАктуализацииНачислений.ПолучитьМакет("НастройкаПоУмолчанию");
		Текст = ТекМакет.ПолучитьТекст();
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Текст);
		Результат = ВыгрузкаЗагрузкаСлужебныхДанных.УниверсальнаяЗагрузкаСправочников(ЧтениеXML, Истина);
		
		ЧтениеXML.Закрыть();
		
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;

КонецПроцедуры

// Процедура обновляет сохраненные схемы настроек на схему по схеме из макета
//
Процедура ОбновитьСхемуФормированияНастройкиДействий() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаВариантовДействийАктуализацииНачислений.Ссылка,
		|	НастройкаВариантовДействийАктуализацииНачислений.СхемаФормирования
		|ИЗ
		|	Справочник.НастройкаВариантовДействийАктуализацииНачислений КАК НастройкаВариантовДействийАктуализацииНачислений";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СхемаФормирования.Получить() = Неопределено Тогда
			//Схемы нет, значит в настройке ошибка, переформировывать не будем
			Продолжить;
		КонецЕсли;
		
		ТекНастройка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Отказ = Ложь;
		СформироватьСхемуФормирования(ТекНастройка,Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекНастройка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьСхемуФормирования(НастройкаВариантовДействий)
	
	НастройкаВариантовДействий.СхемаФормирования = Новый ХранилищеЗначения(Неопределено);
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для настройки вариантов действий ""%1"" не удалось сформировать схему компоновки данных.'"),НастройкаВариантовДействий.Наименование);
	ОбщегоНазначения.СообщитьПользователю(Текст);
	
КонецПроцедуры

Функция ПолучитьВариантыПоНастройке(Настройка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаВариантовДействийАктуализацииНачисленийТаблицаВариантов.ВариантДействий
		|ИЗ
		|	Справочник.НастройкаВариантовДействийАктуализацииНачислений.ТаблицаВариантов КАК НастройкаВариантовДействийАктуализацииНачисленийТаблицаВариантов
		|ГДЕ
		|	НастройкаВариантовДействийАктуализацииНачисленийТаблицаВариантов.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Настройка);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ВариантДействий");
 
КонецФункции

#КонецОбласти


#КонецЕсли
